{
  "name": "Shantanu Pradhan",
  "title": "Unity Developer",
  "description": "I’m a Unity Game Developer with 2.5+ years of experience crafting fun and engaging 2D & 3D games for WebGL and native platforms. But beyond the code, I’m also a gamer — someone who understands what makes games enjoyable, addictive, and memorable.\n I don't just develop games — I think about them, play them, and constantly look for creative ways to improve them.\n Whether it's brainstorming a quirky game concept, prototyping something fresh, or giving constructive feedback on a game, I enjoy contributing beyond just development.",
  "socialLinks": [
    {
      "icon": "BsWhatsapp",
      "url": "https://wa.me/qr/23YQGPIFFQHXK1"
    },
    {
      "icon": "FaXTwitter",
      "url": "https://x.com/Shantanu721998?t=sqnXzi5QBzkntFL-5su3cw&s=09"
    },
    {
      "icon": "BsYoutube",
      "url": "https://www.youtube.com/playlist?list=PL0BNHuQoKhsHiBhVI400OPt8gJpbqKazz"
    },
    {
      "icon": "FaLinkedinIn",
      "url": "https://www.linkedin.com/in/shantanu-pradhan-39b0321ba/"
    },
    {
      "icon": "MdEmail",
      "url": "mailto:72shnatanu@gmail.com"
    }
  ],
  "projects": [
    {
      "id": 1,
      "title": "Christmas Battle",
      "type": "2D Shooter Tower Defence",
      "description": "A 2D Christmas-themed shooter tower defense game where you play as Santa Claus, defending his cattle barn full of gifts from waves of goblin-like enemies. Santa uses snowballs to stop the enemies before they steal the presents. The game features 7 unique enemy types, a wave-based system, and a coin-based upgrade system that lets you enhance Santa’s abilities by defeating enemies and collecting coins.",
      "technologies": ["Unity", "C#"],
      "image": "./blog.jpg",
      "playstoreUrl": "",
      "playUrl": "https://play.amezgame.com/christmasbattle/index.html",
      "video": "https://youtube.com/play"
    },
    {
      "id": 2,
      "title": "The Lost Color",
      "type": "2D Action Platformer",
      "description": "A 2D action platformer based on a color-themed world where some platforms are vibrant while others are blacked out. Players must shoot enemies, collect stars and coins, and reach the end of each level. The game features enemy AI that follows and attacks the player, boss battles, and arena-style combat sections in every level for added challenge.",
      "technologies": ["Unity", "C#"],
      "image": "./spotify.jpg",
      "playstoreUrl": "",
      "playUrl": "https://play.amezgame.com/thelostcolors/index.html",
      "video": "https://youtube.com/play"
    },
    {
      "id": 3,
      "title": "Egg Drop",
      "type": "Casual",
      "description": "A fun and casual egg-dropping game where eggs fall from the sky and you must tap to bounce them safely into the nest. Avoid hitting platforms or the egg will crack and break! Collect power-ups during gameplay and unlock new egg skins from the in-game shop and is integrated with Firebase Remote Config for dynamic content and feature control.\nA WebGL demo is also available to play online.",
      "technologies": ["Unity", "C#"],
      "image": "./store.jpg",
      "playstoreUrl": "https://play.google.com/store/apps/details?id=com.appspace.eggdrop",
      "playUrl": "https://play.amezgame.com/eggdrop/index.html",
      "video": "https://youtube.com/play"
    },
    {
      "id": 4,
      "title": "Mystic Find",
      "type": "Hidden Object Puzzle",
      "description": "A hidden object puzzle game where players are shown an image filled with various items, and must find and tap specific hidden objects within the scene. The game includes a hint system to help players when they get stuck. It features in-app purchases (IAP) for hints or unlocks, notifications to keep players engaged, and is integrated with Firebase Remote Config for dynamic content and feature control.",
      "technologies": ["Unity", "C#"],
      "image": "././weather.jpg",
      "playstoreUrl": "https://play.google.com/store/apps/details?id=search.hidden.object.android.game",
      "playUrl": "",
      "video": "https://youtube.com/play"
    },
    {
      "id": 5,
      "title": "Zig Zag Zone",
      "type": "Arcade",
      "description": "A collection of three different zig-zag style platformer games, each offering a unique twist on the core mechanic. Players control a moving ball and must tap to avoid obstacles and navigate challenging paths. The game also includes a profile system to track progress, high scores, and unlockables across all three game modes.",
      "technologies": ["Unity", "C#"],
      "image": "./weather.jpg",
      "playstoreUrl": "https://play.google.com/store/apps/details?id=com.appspace.zigzag",
      "playUrl": "",
      "video": "https://youtube.com/play"
    },
    {
      "id": 6,
      "title": "Tap Tap Ball",
      "type": "Casual",
      "description": "A simple and addictive basketball-style tap game where you tap to shoot the ball into the hoop. After each successful goal, the hoop switches sides — from right to left and back — creating a continuous loop. The challenge increases with speed and timing, making it a fun test of precision and rhythm.",
      "technologies": ["Unity", "C#"],
      "image": "./weather.jpg",
      "playUrl": "https://play.amezgame.com/taptapball/index.html",
      "video": "https://youtube.com/play"
    },
    {
      "id": 7,
      "title": "Boingy Rabbit",
      "type": "Arcade",
      "description": "A fun and challenging tap-based arcade game where a rabbit bounces between two strings, moving only up and down. Tap to switch the rabbit’s position and avoid incoming stones and obstacles. Timing and quick reflexes are key to surviving and scoring high!",
      "technologies": ["Unity", "C#"],
      "image": "./weather.jpg",
      "playUrl": "https://play.amezgame.com/boingyrabbit/index.html",
      "video": "https://youtube.com/play"
    },
    {
      "id": 8,
      "title": "Bubble Shooter",
      "type": "Casual Puzzle",
      "description": "Match and pop bubbles in this fun puzzle game! Lives reduce each time you play and refill over time. Use boosters, clear levels, and enjoy bubble-popping fun anytime!",
      "technologies": ["Unity", "C#"],
      "image": "./weather.jpg",
      "playUrl": "https://play.amezgame.com/bubblemaster/index.html",
      "video": "https://youtube.com/play"
    },
    {
      "id": 9,
      "title": "Bounce ball",
      "type": "Casual",
      "description": "A relaxing and rhythmic 3D ball bouncing game where a ball automatically bounces from one tile to another. The player controls the ball’s left and right movement to ensure it lands perfectly on the tiles. Each successful bounce plays a piano note, creating a satisfying and musical gameplay experience.",
      "technologies": ["Unity", "C#"],
      "image": "./weather.jpg",
      "playUrl": "https://play.amezgame.com/bouncyball/index.html",
      "video": "https://youtube.com/play"
    },
    {
      "id": 10,
      "title": "Space Shooter (In Production)",
      "type": "Arcade",
      "description": "Blast off into the stars in this thrilling Space Shooter game packed with action, strategy, and progression! Navigate a zig-zag level selection menu where each level unlocks in a unique diagonal path, adding a fun twist to classic level progression.",
      "technologies": ["Unity", "C#"],
      "image": "weather.jpg",
      "playstoreUrl": "",
      "video": "https://youtube.com/play"
    },
    {
      "id": 11,
      "title": "Fruit Merge (Demo)",
      "type": "Hybrid Casual",
      "description": "A creative hybrid casual game where fruits drop into a container and merge with identical fruits to evolve into higher-level fruits. With each successful merge, players earn keys that can be used to build and customize a place or world — combining puzzle merging mechanics with light progression/building elements.",
      "technologies": ["Unity", "C#"],
      "image": "weather.jpg",
      "playstoreUrl": "",
      "video": "https://youtube.com/play"
    },
    {
      "id": 12,
      "title": "Fist Fight (Demo)",
      "type": "Arcade",
      "description": "A fast-paced martial arts action game inspired by Fist of Fury, where you play as a martial arts master balancing between zen focus and furious combat. Enemies attack from all sides — your goal is to react quickly and strike with perfect timing.",
      "technologies": ["Unity", "C#"],
      "image": "weather.jpg",
      "playstoreUrl": "",
      "video": "https://youtube.com/play"
    },
    {
      "id": 13,
      "title": "Zombie Shooter (Demo)",
      "type": "Survival , Action , Shooter",
      "description": "A thrilling 3D zombie shooter survival game where the player must fight and hide while making their way to a safe point. Zombies are powered by a smart AI system — they will follow and attack if you get too close or fire your weapon.\nSurvival depends on managing your resources:\nYour flashlight battery drains over time, and you must explore the environment to collect batteries and bullets to stay alive. Stealth, aim, and timing are key in this intense fight for survival.",
      "technologies": ["Unity", "C#"],
      "image": "weather.jpg",
      "playstoreUrl": "",
      "video": "https://youtube.com/play"
    },
    {
      "id": 14,
      "title": "3d Fighting (Demo)",
      "type": "Fighting",
      "description": "A demo prototype of a 3D fighting game inspired by Tekken 3, built to showcase basic fighting mechanics, character control, and combo-based gameplay. Players can engage in 1v1 matches using a limited set of characters with unique move sets and animations.",
      "technologies": ["Unity", "C#"],
      "image": "weather.jpg",
      "playstoreUrl": "",
      "video": "https://youtube.com/play"
    },
    {
      "id": 15,
      "title": "Wheel Runner (Demo)",
      "type": "Endless Runner",
      "description": "A fast-paced endless runner inspired by Temple Run, where you control a character running through dangerous paths. Dodge obstacles, slide and jump, and collect coins as you go.",
      "technologies": ["Unity", "C#"],
      "image": "./weather.jpg",
      "playstoreUrl": "",
      "video": "https://youtube.com/play"
    }
  ],
  "experiences": [
    {
      "id": 1,
      "year": "Dec 2022 - present",
      "company": "Rareprob Solution Private Limited",
      "position": "Unity Game Developer",
      "description": "Experienced Unity Game Developer with expertise in developing both 2D and 3D games for WebGL and native platforms. Proficient in Firebase integration, ads implementation, and optimizing games for performance and memory efficiency. Skilled in creating universal packages for modular development. Strong creative sense in designing unique gameplay, engaging storylines, and thematic game worlds. Experienced in terrain creation for 3D environments and animation systems using Unity's Timeline and DOTween for smooth character and UI animations. Also well-versed in building physics systems and delivering polished user experiences across platforms.",
      "technologies": ["Unity", "C#"]
    }
  ],
  "demo_video": [
    {
      "id": "1",
      "title": "My Demo Video",
      "youtubeUrl": "https://www.youtube.com/watch?v=dQw4w9WgXcQ"
    },
    {
      "id": "2",
      "title": "Another Demo",
      "youtubeUrl": "https://www.youtube.com/watch?v=3JZ_D3ELwOQ"
    }
  ]
}